routes/web.php

select * from `users` where `users`.`id` in (1)
select * from `watch_lists` where `watch_lists`.`user_id` = 1 and `watch_lists`.`user_id` is not null
---
    ->middleware(['auth', 'verified'])
    ->name('watchlist.index');

Route::get('/dashboard', function () {
//    $user = auth()->user();
//    $stats = [
//        'total' => $user->watchLists()->count(),
//        'watching' => $user->watchLists()
//                            ->whereHas('status', function($query) {
//                                $query->where('name', 'watching');
//                            })
//                            ->count(),
//        'completed' => $user->watchLists()
//                            ->whereHas('status', function($query) {
//                                $query->where('name', 'completed');
//                            })
//                            ->count(),
//        'wantToWatch' => $user->watchLists()
//                            ->whereHas('status', function($query) {
//                                $query->where('name', 'want_to_watch');
//                            })
//                            ->count(),
//        'avgRating' => $user->watchLists
//                            ->avg('rating')

select `id` from `watch_lists` where `watch_lists`.`user_id` = 1 and `watch_lists`.`user_id` is not null
---
        'want_to_watch',
    ])->pluck('id','name');

    $stats = DB::table('watch_lists')
        ->where('user_id', auth()->id())
        ->selectRaw("
            COUNT(*) AS total,
            SUM(CASE WHEN status_id = ? THEN 1 ELSE 0 END) AS watching,
            SUM(CASE WHEN status_id = ? THEN 1 ELSE 0 END) AS completed,
            SUM(CASE WHEN status_id = ? THEN 1 ELSE 0 END) AS want_to_watch,
            AVG(rating) AS avg_rating
        ",
        [
            $statusIds['watching'],
            $statusIds['completed'],
            $statusIds['want_to_watch'],
        ])
        ->first();